# SynchronizeWithCentralOptions Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
SynchronizeWithCentralOptions Constructor
SynchronizeWithCentralOptions Class See Also
---
Constructs a new instance of SynchronizeWithCentralOptions initialized with default options.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public SynchronizeWithCentralOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SynchronizeWithCentralOptions()
```

# See Also
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace